#### BuiltInFailures.ZoneFailures Members

---

|  |
| --- |
| BuiltInFailures ZoneFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures ZoneFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | ZoneExistsNotEnclosedRoom | Zone has a room not enclosed. |
| Public property Static member | ZoneNotEnclosed | Zone not enclosed totally. |
| Public property Static member | ZonesOverlapWarning | Zone overlap to another zone or another room. |

# See Also

BuiltInFailures ZoneFailures Class

Autodesk.Revit.DB Namespace